#### Terraform Format and Style 🖌``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security_group_tcp.aws_security_group.default[0] will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Instance default security group (only egress access is allowed)."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "security-group-tcp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "tcp"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "security-group-tcp"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-security-group"
        }
      + tags_all               = {
          + "Environment" = "tcp"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "security-group-tcp"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-security-group"
        }
      + vpc_id                 = (sensitive)
    }

  # module.security_group_tcp.aws_security_group_rule.egress[0] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.security_group_tcp.aws_security_group_rule.egress_ipv6[0] will be created
  + resource "aws_security_group_rule" "egress_ipv6" {
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[0] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 20
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 20
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[1] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 21
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 21
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[2] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[3] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 23
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 23
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[4] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 25
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 25
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[5] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 445
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 445
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[6] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 1433
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1433
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[7] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 3389
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3389
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[8] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 4333
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4333
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[9] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[10] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[11] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 5500
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5500
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[12] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 5900
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5900
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[13] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 1521
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1521
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[14] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 5601
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5601
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[15] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8020
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8020
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[16] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 50070
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 50070
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[17] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 50470
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 50470
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[18] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 4505
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4505
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[19] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 4506
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4506
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[20] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 2375
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2375
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[21] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 2376
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2376
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress[22] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[0] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 20
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 20
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[1] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 21
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 21
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[2] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[3] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 23
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 23
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[4] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 25
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 25
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[5] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 445
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 445
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[6] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 1433
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1433
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[7] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 3389
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3389
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[8] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 4333
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4333
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[9] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 3306
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[10] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 5432
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[11] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 5500
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5500
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[12] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 5900
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5900
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[13] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 1521
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1521
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[14] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 5601
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5601
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[15] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 8020
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8020
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[16] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 50070
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 50070
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[17] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 50470
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 50470
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[18] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 4505
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4505
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[19] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 4506
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4506
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[20] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 2375
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2375
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[21] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 2376
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2376
      + type                     = "ingress"
    }

  # module.security_group_tcp.aws_security_group_rule.ingress_ipv6[22] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 53
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group.default[0] will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Instance default security group (only egress access is allowed)."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "security-group-udp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "udp"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "security-group-udp"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-security-group"
        }
      + tags_all               = {
          + "Environment" = "udp"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "security-group-udp"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-security-group"
        }
      + vpc_id                 = (sensitive)
    }

  # module.security_group_udp.aws_security_group_rule.egress[0] will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.security_group_udp.aws_security_group_rule.egress_ipv6[0] will be created
  + resource "aws_security_group_rule" "egress_ipv6" {
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress[0] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress[1] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 135
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 135
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress[2] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 137
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 137
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress[3] will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 138
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 138
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress_ipv6[0] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 53
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress_ipv6[1] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 135
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 135
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress_ipv6[2] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 137
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 137
      + type                     = "ingress"
    }

  # module.security_group_udp.aws_security_group_rule.ingress_ipv6[3] will be created
  + resource "aws_security_group_rule" "ingress_ipv6" {
      + from_port                = 138
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 138
      + type                     = "ingress"
    }

  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "test"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-test-default-sg"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-test-default-sg"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "test"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-test-igw"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + tags_all = {
          + "Environment" = "test"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-test-igw"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = false
      + enable_classiclink_dns_support   = false
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Environment" = "test"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-test"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
      + tags_all                         = {
          + "Environment" = "test"
          + "Managedby"   = "hello@clouddrove.com"
          + "Name"        = "vpc-test"
          + "Repository"  = "https://github.com/clouddrove/terraform-aws-vpc"
        }
    }

Plan: 63 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @indercodes, Action: `pull_request`*